# สร้าง stage แรกจากภาพ Docker ของ Go เวอร์ชันล่าสุด
FROM golang:1.26.5

# ตั้งไดเรกทอรีทำงานภายในคอนเทนเนอร์เป็น /app
WORKDIR /app

# คัดลอกไฟล์ go.mod และ go.sum เพื่อให้สามารถดาวน์โหลด dependency ได้ก่อน
COPY go.mod go.sum ./

# ดาวน์โหลด dependencies จากโมดูล Go
RUN go mod download

# คัดลอกซอร์สโค้ดทั้งหมดจากโฮสต์ไปยังคอนเทนเนอร์
COPY . .

# สร้างไบนารีจากโค้ด Go แล้วตั้งชื่อไฟล์ว่า main
RUN go build -o main .

# ประกาศพอร์ตที่คอนเทนเนอร์จะเปิดใช้งาน
EXPOSE 5000

# คำสั่งเริ่มต้นเมื่อรันคอนเทนเนอร์ คือรันไฟล์ไบนารี main
CMD ["./main"]